# Point messages
point.name.notNull = \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043F\u0443\u043D\u043A\u0442\u0430 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u043D\u0435 null
point.name.notEmpty = \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043F\u0443\u043D\u043A\u0442\u0430 \u043D\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u043F\u0443\u0441\u0442\u044B\u043C
point.name.size = \u0420\u0430\u0437\u043C\u0435\u0440 \u043D\u0430\u0437\u0432\u0430\u043D\u0438\u044F \u043F\u0443\u043D\u043A\u0442\u0430 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u043E\u0442 3 \u0434\u043E 50 \u0441\u0438\u043C\u0432\u043E\u043B\u043E\u0432
error.point.haveId = \u041E\u0448\u0438\u0431\u043A\u0430. \u0423 \u043F\u0443\u043D\u043A\u0442\u0430 \u0435\u0441\u0442\u044C \u0438\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440 (id). \u0423 \u044D\u0442\u043E\u0433\u043E \u043F\u0443\u043D\u043A\u0442\u0430 \u043D\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C id
error.point.name.notUnique = \u041E\u0448\u0438\u0431\u043A\u0430. \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043F\u0443\u043D\u043A\u0442\u0430 \u043D\u0435 \u0443\u043D\u0438\u043A\u0430\u043B\u044C\u043D\u043E. \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043F\u0443\u043D\u043A\u0442\u0430 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u0443\u043D\u0438\u043A\u0430\u043B\u044C\u043D\u043E
error.point.haveNoId = \u041E\u0448\u0438\u0431\u043A\u0430. \u0423 \u043F\u0443\u043D\u043A\u0442\u0430 \u043D\u0435\u0442 \u0438\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u0430 (id). \u0423 \u044D\u0442\u043E\u0433\u043E \u043F\u0443\u043D\u043A\u0442\u0430 \u0434\u043E\u043B\u0436\u0435\u043D \u0431\u044B\u0442\u044C id
error.point.id.notExist = \u041E\u0448\u0438\u0431\u043A\u0430. \u041F\u0443\u043D\u043A\u0442 \u0441 \u0434\u0430\u043D\u043D\u044B\u043C \u0438\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u043E\u043C (id) \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442
error.point.name.notExist = \u041E\u0448\u0438\u0431\u043A\u0430. \u041F\u0443\u043D\u043A\u0442 \u0441 \u0434\u0430\u043D\u043D\u044B\u043C \u043D\u0430\u0437\u0432\u0430\u043D\u0438\u0435\u043C \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442
controller.point.unexpectedId = \u041E\u0448\u0438\u0431\u043A\u0430. \u0418\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u044B (id) \u043D\u0435 \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u044E\u0442. \
  \u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0430\u044F \u0432 \u0430\u0434\u0440\u0435\u0441\u043D\u043E\u0439 \u0441\u0442\u0440\u043E\u043A\u0435 \u0434\u043E\u043B\u0436\u043D\u0430 \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u0442\u044C \u0441 "id" \u043F\u0443\u043D\u043A\u0442\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0431\u0443\u0434\u0435\u0442 \u043E\u0431\u043D\u0430\u0432\u043B\u0451\u043D
point.hasNo.roads = \u041A \u044D\u0442\u043E\u043C\u0443 \u043F\u0443\u043D\u043A\u0442\u0443 \u043D\u0435\u0442 \u0434\u043E\u0440\u043E\u0433. \u0413\u0440\u0443\u0437 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u0434\u043E\u0441\u0442\u0430\u0432\u043B\u0435\u043D.

# Road messages
road.distance.notNull = \u0414\u043B\u0438\u043D\u043D\u0430 \u043F\u0443\u0442\u0438 \u0434\u043E\u043B\u0436\u043D\u0430 \u0431\u044B\u0442\u044C \u043D\u0435 null
road.distance.positive = \u0414\u043B\u0438\u043D\u043D\u0430 \u043F\u0443\u0442\u0438 \u0434\u043E\u043B\u0436\u043D\u0430 \u0431\u044B\u0442\u044C \u043F\u043E\u043B\u043E\u0436\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u043C \u0447\u0438\u0441\u043B\u043E\u043C
error.road.haveNoId = \u041E\u0448\u0438\u0431\u043A\u0430. \u0423 \u0434\u043E\u0440\u043E\u0433\u0438 \u0435\u0441\u0442\u044C \u0438\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440 (id). \u0423 \u044D\u0442\u043E\u0439 \u0434\u043E\u0440\u043E\u0433\u0438 \u043D\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C id
error.road.id.notExist = \u041E\u0448\u0438\u0431\u043A\u0430. \u0414\u043E\u0440\u043E\u0433\u0430 \u0441 \u0434\u0430\u043D\u043D\u044B\u043C \u0438\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u043E\u043C (id) \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442
error.road.pointsNotExist = \u0414\u043E\u0440\u043E\u0433\u0430 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0430 \u0438\u043B\u0438 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0430. \u041F\u0443\u043D\u043A\u0442 \u0441 \u0434\u0430\u043D\u043D\u044B\u043C \u0438\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u043E\u043C (id) \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442
road.pointId.notNull = Id of point in entity road must not be null
controller.road.unexpectedId = Error. Ids don't match. Path variables "id1" and "1d2" \
  must match "point1Id" and "point2Id" of road which will be updated

# Car messages
car.carModel.notNull = Field carModel of car must not be null
car.point.notNull = Field point of car must not be null
car.transporter.notNull = Field transporter of car must not be null
car.cost.notNull = Field cost of car must not be null
car.cost.notPositive = Cost of car must be positive number
error.car.haveId = Error. Car has id. This car must not have an id
error.car.haveNoId = Error. Car hasn't id. This Car must have an id
error.car.id.notExist = Error. Car with the given id doesn't exist
error.car.carModel.isNull = Error. Field carModel of car is null. Field carModel of car must not be null
error.car.point.isNull = Error. Field point of car is null. Field point of car must not be null
error.car.transporter.isNull = Error. Field transporter of car is null. Field transporter of car must not be null
controller.car.unexpectedId = Error. Ids don't match. Path variable "id" must match "id" car which will be updated
error.car.user.role.noTransporter = Error. Set of roles don't contain "TRANSPORTER" role. One role from set must be "TRANSPORTER" role

# CarModel messages
carModel.name.notNull = Name of carModel must not be null
carModel.name.notEmpty = Name of carModel must not be empty
carModel.name.size = Size of name must be from 3 to 50 characters
carModel.tonnage.notNull = Field tonnage of carModel must not be null
carModel.tonnage.notPositive = Field tonnage of carModel must be positive number
carModel.space.notNull = Field space of carModel must not be null
carModel.space.notPositive = Field space of carModel must be positive number
error.carModel.haveId = Error. Point has id. This carModel must not have an id
error.carModel.name.notUnique = Error. Name of carModel isn't unique. Name of carModel must be unique
error.carModel.haveNoId = Error. CarModel hasn't id. This Point must have an id
error.carModel.id.notExist = Error. Point with the given id doesn't exist
controller.carModel.unexpectedId = Error. Ids don't match. Path variable "id" must match "id" carModel which will be updated

# Role messages
role.name.notNull = Name of role must not be null
role.name.notEmpty = Name of role must not be empty
role.name.size = Size of name must be from 3 to 50 characters
error.role.haveId = Error. Point has id. This role must not have an id
error.role.name.notUnique = Error. Name of role isn't unique. Name of role must be unique
error.role.haveNoId = Error. Role hasn't id. This Point must have an id
error.role.id.notExist = Error. Point with the given id doesn't exist
controller.role.unexpectedId = Error. Ids don't match. Path variable "id" must match "id" role which will be updated

# User messages
user.name.size = Size of name must be from 3 to 50 characters
user.surname.size = Size of surname must be from 3 to 50 characters
user.phone.size = Size of phone must be from 3 to 15 characters
user.eMail = E-mail is'n valid
user.username.notNull = Username of user must not be null
user.username.notEmpty = Username of user must not be empty
user.username.size = Size of username must be from 3 to 50 characters
user.password.notNull = Password of user must not be null
user.password.notEmpty = Password of user must not be empty
user.password.size = Size of password must be from 3 to 100 characters
user.roles.notNull = Set of user's roles must not be null
user.roles.notEmpty = Set of user's roles must not be empty
user.role.notNull = Each role from user's roles must not be null
user.role.notEmpty = Each role from user's roles must not be empty
user.role.size = Each name of role from user's roles must be from 3 to 50 characters
error.user.haveId = Error. User has id. This user must not have an id
error.user.username.notUnique = Error. Username of user isn't unique. Username of user must be unique
error.user.haveNoId = Error. User hasn't id. This user must have an id
error.user.id.notExist = Error. User with the given id doesn't exist
error.user.role.isNull = Error. One of user's roles is null. All user's roles must not be null
controller.user.unexpectedId = Error. Ids don't match. Path variable "id" must match "id" user which will be updated

# Solution messages
solution.dateTime.notNull = Date of solution must not be null
solution.dateTime.notFuture = Date of solution can't be in the future
solution.supplier.notNull = Supplier who has asked for solution must not be null
solutionCar.solution.notNull = Field solution of solutionCar must not be null
solutionCar.car.notNull = Field car of solutionCar must not be null
route.mass.notNull = Mass of route in solution must not be null
route.mass.positive = Mass of route in solution must be positive number
route.cost.notNull = Cost of deliver in solution must not be null
route.cost.positive = Cost of deliver in solution must be positive number
route.point.notNull = Delivery point in solution must not be null
route.solutionCar.notNull = Field solutionCar of route must not be null
error.solution.id.notExist = Error. Solution with the given id doesn't exist
error.solution.notEnough.cars = It's not enough cars in start point. The cargo can't be delivered.

# Task messages
task.points.notNull = List of points in task must not be null
task.pointName.notNull = Each point's name in task must not be null
task.pointName.notEmpty = Each point's name in task must not be empty
task.orderList.notNull = List of order in task must not be null
task.order.notNull = Each order's quantity in task must not be null
task.order.positive = Each order's quantity in task must be positive number
task.username.notNull = Username of user who has asked for solution in task must not be null
task.username.notEmpty = Username of user who has asked for solution in task must not be empty