# Point messages
error.point.haveId = \u041E\u0448\u0438\u0431\u043A\u0430. \u0423 \u043F\u0443\u043D\u043A\u0442\u0430 \u0435\u0441\u0442\u044C \u0438\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440 (id). \u0423 \u044D\u0442\u043E\u0433\u043E \u043F\u0443\u043D\u043A\u0442\u0430 \u043D\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C id
error.point.name.notUnique = \u041E\u0448\u0438\u0431\u043A\u0430. \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043F\u0443\u043D\u043A\u0442\u0430 \u043D\u0435 \u0443\u043D\u0438\u043A\u0430\u043B\u044C\u043D\u043E. \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043F\u0443\u043D\u043A\u0442\u0430 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u0443\u043D\u0438\u043A\u0430\u043B\u044C\u043D\u043E
error.point.haveNoId = \u041E\u0448\u0438\u0431\u043A\u0430. \u0423 \u043F\u0443\u043D\u043A\u0442\u0430 \u043D\u0435\u0442 \u0438\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u0430 (id). \u0423 \u044D\u0442\u043E\u0433\u043E \u043F\u0443\u043D\u043A\u0442\u0430 \u0434\u043E\u043B\u0436\u0435\u043D \u0431\u044B\u0442\u044C id
error.point.id.notExist = \u041E\u0448\u0438\u0431\u043A\u0430. \u041F\u0443\u043D\u043A\u0442 \u0441 \u0434\u0430\u043D\u043D\u044B\u043C \u0438\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u043E\u043C (id) \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442
error.point.name.notExist = \u041E\u0448\u0438\u0431\u043A\u0430. \u041F\u0443\u043D\u043A\u0442 \u0441 \u0434\u0430\u043D\u043D\u044B\u043C \u043D\u0430\u0437\u0432\u0430\u043D\u0438\u0435\u043C \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442
controller.point.unexpectedId = \u041E\u0448\u0438\u0431\u043A\u0430. \u0418\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u044B (id) \u043D\u0435 \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u044E\u0442. \
  \u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0430\u044F \u0432 \u0430\u0434\u0440\u0435\u0441\u043D\u043E\u0439 \u0441\u0442\u0440\u043E\u043A\u0435 \u0434\u043E\u043B\u0436\u043D\u0430 \u0441\u043E\u0432\u043F\u0430\u0434\u0430\u0442\u044C \u0441 "id" \u043F\u0443\u043D\u043A\u0442\u0430 \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0431\u0443\u0434\u0435\u0442 \u043E\u0431\u043D\u0430\u0432\u043B\u0451\u043D
point.hasNo.roads = \u041A \u044D\u0442\u043E\u043C\u0443 \u043F\u0443\u043D\u043A\u0442\u0443 \u043D\u0435\u0442 \u0434\u043E\u0440\u043E\u0433. \u0413\u0440\u0443\u0437 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u0434\u043E\u0441\u0442\u0430\u0432\u043B\u0435\u043D.

# Road messages
error.road.haveNoId = \u041E\u0448\u0438\u0431\u043A\u0430. \u0423 \u0434\u043E\u0440\u043E\u0433\u0438 \u0435\u0441\u0442\u044C \u0438\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440 (id). \u0423 \u044D\u0442\u043E\u0439 \u0434\u043E\u0440\u043E\u0433\u0438 \u043D\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C id
error.road.id.notExist = \u041E\u0448\u0438\u0431\u043A\u0430. \u0414\u043E\u0440\u043E\u0433\u0430 \u0441 \u0434\u0430\u043D\u043D\u044B\u043C \u0438\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u043E\u043C (id) \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442
error.road.pointsNotExist = \u0414\u043E\u0440\u043E\u0433\u0430 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0430 \u0438\u043B\u0438 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0430. \u041F\u0443\u043D\u043A\u0442 \u0441 \u0434\u0430\u043D\u043D\u044B\u043C \u0438\u043D\u0434\u0435\u0442\u0438\u0444\u0438\u043A\u0430\u0442\u043E\u0440\u043E\u043C (id) \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442
road.pointName.notNull = Id of point in entity road must not be null
controller.road.unexpectedId = Error. Ids don't match. Path variables "id1" and "1d2" \
  must match "point1Id" and "point2Id" of road which will be updated

# Car messages
error.car.haveId = Error. Car has id. This car must not have an id
error.car.haveNoId = Error. Car hasn't id. This Car must have an id
error.car.id.notExist = Error. Car with the given id doesn't exist
error.car.carModel.isNull = Error. Field carModel of car is null. Field carModel of car must not be null
error.car.point.isNull = Error. Field point of car is null. Field point of car must not be null
error.car.transporter.isNull = Error. Field transporterUsername of car is null. Field transporterUsername of car must not be null
controller.car.unexpectedId = Error. Ids don't match. Path variable "id" must match "id" car which will be updated
error.car.user.role.noTransporter = Error. Set of roles don't contain "TRANSPORTER" role. One role from set must be "TRANSPORTER" role

# CarModel messages
error.carModel.haveId = Error. Point has id. This carModel must not have an id
error.carModel.name.notUnique = Error. Name of carModel isn't unique. Name of carModel must be unique
error.carModel.haveNoId = Error. CarModel hasn't id. This Point must have an id
error.carModel.id.notExist = Error. Point with the given id doesn't exist
controller.carModel.unexpectedId = Error. Ids don't match. Path variable "id" must match "id" carModel which will be updated

# Role messages
error.role.haveId = Error. Point has id. This role must not have an id
error.role.name.notUnique = Error. Name of role isn't unique. Name of role must be unique
error.role.haveNoId = Error. Role hasn't id. This Point must have an id
error.role.id.notExist = Error. Role with the given id doesn't exist
controller.role.unexpectedId = Error. Ids don't match. Path variable "id" must match "id" role which will be updated

# User messages
error.user.haveId = Error. User has id. This user must not have an id
error.user.username.notUnique = Error. Username of user isn't unique. Username of user must be unique
error.user.haveNoId = Error. User hasn't id. This user must have an id
error.user.id.notExist = Error. User with the given id doesn't exist
error.user.role.isNull = Error. One of user's roles is null. All user's roles must not be null
controller.user.unexpectedId = Error. Ids don't match. Path variable "id" must match "id" user which will be updated

# Solution messages
error.solution.id.notExist = Error. Solution with the given id doesn't exist
error.solution.notEnough.cars = It's not enough cars in start point. The cargo can't be delivered.